In [6]:
import numpy as np

In [3]:
import pandas as pd

In [5]:
import sklearn as sk

In [8]:
import matplotlib.pyplot as plt

In [27]:
data = pd.read_csv('titanic.csv')

# Exploratory Data Analysis

In [20]:
data.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Embarked,Survived
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,S,0
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,C,1
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,S,1
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,S,1
4,5,3,"Allen, Mr. William Henry",male,35.0,0,0,S,0

In [21]:
data.tail()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Embarked,Survived
886,887,2,"Montvila, Rev. Juozas",male,27.0,0,0,S,0
887,888,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,S,1
888,889,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,S,0
889,890,1,"Behr, Mr. Karl Howell",male,26.0,0,0,C,1
890,891,3,"Dooley, Mr. Patrick",male,32.0,0,0,Q,0

In [26]:
data.shape

(891, 9)